benchmarks/02_metal_bunsen_flame_cloud/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // Bottom plane z = 0
    ( 0     0                   0.0 )   // 0
    (0.01  -0.000261859216  0.0 )   // 1
    (0.01   0.000261859216  0.0 )   // 2
    (0.011  -0.000288045137  0.0 )   // 3
    (0.011   0.000288045137  0.0 )   // 4
    (0.04  -0.001047436863  0.0 )   // 5
    (0.04   0.001047436863  0.0 )   // 6

    // Top plane z = 0.080 m
    ( 0     0                   0.08 )   // 7
    (0.01  -0.000261859216  0.08 )   // 8
    (0.01   0.000261859216  0.08 )   // 9
    (0.011  -0.000288045137  0.08 )   // 10
    (0.011   0.000288045137  0.08 )   // 11
    (0.04  -0.001047436863  0.08 )   // 12
    (0.04   0.001047436863  0.08 )   // 13
);

blocks
(
    // Block 0: Nozzle (r: 0 -> 10 mm, 50 cells; axial: 400 cells)
    hex ( 0  1  2  0  7  8  9  7 ) (50 1 400) simpleGrading (1 1 1)

    // Block 1: Wall Lip (r: 10 -> 11 mm, 5 cells; axial: 400 cells)
    hex ( 1  3  4  2  8 10 11  9 ) ( 5 1 400) simpleGrading (1 1 1)

    // Block 2: Co-flow (r: 11 -> 40 mm, 145 cells; axial: 400 cells)
    hex ( 3  5  6  4 10 12 13 11 ) (145 1 400) simpleGrading (1 1 1)
);

boundary
(
    nozzleInlet
    {
        type patch;
        faces
        (
            (1 0 0 2)
        );
    }

    burnerWall
    {
        type wall;
        faces
        (
            (3 1 2 4)
        );
    }

    coflowInlet
    {
        type patch;
        faces
        (
            (5 3 4 6)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (7 8 9 7)
            (8 10 11 9)
            (10 12 13 11)
        );
    }

    outerAtmosphere
    {
        type patch;
        faces
        (
            (5 6 13 12)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0 7 7 0)
        );
    }

    frontAndBack_pos
    {
        type wedge;
        faces
        (
            (2 0 7 9)
            (4 2 9 11)
            (6 4 11 13)
        );
    }

    frontAndBack_neg
    {
        type wedge;
        faces
        (
            (0 1 8 7)
            (1 3 10 8)
            (3 5 12 10)
        );
    }
);

// ************************************************************************* //
