benchmarks/02_metal_bunsen_flame_cloud/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   Operation     | Website:  https://openfoam.org
    \\  /    And           | Version:  13
     \\/     Manipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver            ode;
}

chemistry       on;

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem        0.05;
}

odeCoeffs
{
    solver          seulex;
    absTol          1e-8;
    relTol          1e-1;
}

#include "reactions"

// ************************************************************************* //
