benchmarks/02_metal_bunsen_flame_cloud/constant/cloudProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

clouds
(
    coalCloud1   // Yeh hamari particle properties file ko load karega
);
