benchmarks/02_metal_bunsen_flame_cloud/constant/fvModels
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cloud_activation
{
    type            clouds;
    clouds          (coalCloud1);  // Yeh hamare particle cloud ko activate karega
}
