benchmarks/02_metal_bunsen_flame_cloud/constant/thermophysicalTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminar
{
    model       unityLewisFourier;
}
