benchmarks/02_metal_bunsen_flame_cloud/0/Al_liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Al_liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    nozzleInlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    burnerWall
    {
        type            zeroGradient;
    }

    coflowInlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }

    outerAtmosphere
    {
        type            zeroGradient;
    }

    axis
    {
        type            empty;
    }

    frontAndBack_pos
    {
        type            wedge;
    }

    frontAndBack_neg
    {
        type            wedge;
    }
}

// ************************************************************************* //
