benchmarks/02_metal_bunsen_flame_cloud/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
80000
(
(0.00013333333 -1.5700791e-22 0.0001)
(0.00031111111 -3.53285e-22 0.0001)
(0.00050666667 -5.4816076e-23 0.0001)
(0.0007047619 -1.1672213e-21 0.0001)
(0.0009037037 4.0630618e-22 0.0001)
(0.0011030303 -1.5746011e-22 0.0001)
(0.0013025641 -1.8184166e-21 0.0001)
(0.0015022222 -2.0843041e-21 0.0001)
...
)
;

boundaryField
{
    nozzleInlet
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.00013333333 0 0)
(0.00031111111 6.7788344e-23 0)
(0.00050666667 6.8096461e-23 0)
(0.0007047619 -1.3593208e-22 0)
(0.0009037037 8.0696317e-23 0)
(0.0011030303 -4.8224293e-22 0)
(0.0013025641 5.9486257e-22 0)
(0.0015022222 -2.8595929e-22 0)
...
)
;
    }
    burnerWall
    {
        type            calculated;
        value           nonuniform List<vector> 5((0.01010033 1.7173564e-21 0) (0.010300324 1.9746924e-22 0) (0.010500317 -2.0708522e-21 0) (0.010700312 -2.9254752e-21 0) (0.010900306 -2.0289212e-21 0));
    }
    coflowInlet
    {
        type            calculated;
        value           nonuniform List<vector> 
145
(
(0.0111003 4.1810276e-21 0)
(0.011300295 -2.1103222e-22 0)
(0.01150029 -2.9249285e-21 0)
(0.011700285 -4.223836e-21 0)
(0.01190028 -2.0566582e-21 0)
(0.012100275 3.5730218e-22 0)
(0.012300271 -1.3947217e-21 0)
(0.012500267 3.1988766e-21 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(0.00013333333 0 0.08)
(0.00031111111 -4.4259651e-23 0.08)
(0.00050666667 -6.8096461e-23 0.08)
(0.0007047619 1.3593208e-22 0.08)
(0.0009037037 -1.7953135e-23 0.08)
(0.0011030303 4.1807377e-22 0.08)
(0.0013025641 -4.6454981e-22 0.08)
(0.0015022222 1.5419861e-22 0.08)
...
)
;
    }
    outerAtmosphere
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0.04 -4.6826118e-21 0.0001)
(0.04 -4.6826118e-21 0.0003)
(0.04 -2.0494627e-22 0.0005)
(0.04 -9.1602773e-21 0.0007)
(0.04 -3.1900566e-21 0.0009)
(0.04 4.2727192e-21 0.0011)
(0.04 -9.1602773e-21 0.0013)
(0.04 -9.1602773e-21 0.0015)
...
)
;
    }
    axis
    {
        type            empty;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
