benchmarks/02_metal_bunsen_flame_cloud/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
80000
(
0.00013333333
0.00031111111
0.00050666667
0.0007047619
0.0009037037
0.0011030303
0.0013025641
0.0015022222
...
)
;

boundaryField
{
    nozzleInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.00013333333
0.00031111111
0.00050666667
0.0007047619
0.0009037037
0.0011030303
0.0013025641
0.0015022222
...
)
;
    }
    burnerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 5(0.01010033 0.010300324 0.010500317 0.010700312 0.010900306);
    }
    coflowInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
145
(
0.0111003
0.011300295
0.01150029
0.011700285
0.01190028
0.012100275
0.012300271
0.012500267
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.00013333333
0.00031111111
0.00050666667
0.0007047619
0.0009037037
0.0011030303
0.0013025641
0.0015022222
...
)
;
    }
    outerAtmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.04
0.04
0.04
0.04
0.04
0.04
0.04
0.04
...
)
;
    }
    axis
    {
        type            empty;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
