benchmarks/02_metal_bunsen_flame_cloud/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
80000
(
-1.5700791e-22
-3.53285e-22
-5.4816076e-23
-1.1672213e-21
4.0630618e-22
-1.5746011e-22
-1.8184166e-21
-2.0843041e-21
...
)
;

boundaryField
{
    nozzleInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0
6.7788344e-23
6.8096461e-23
-1.3593208e-22
8.0696317e-23
-4.8224293e-22
5.9486257e-22
-2.8595929e-22
...
)
;
    }
    burnerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 5(1.7173564e-21 1.9746924e-22 -2.0708522e-21 -2.9254752e-21 -2.0289212e-21);
    }
    coflowInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
145
(
4.1810276e-21
-2.1103222e-22
-2.9249285e-21
-4.223836e-21
-2.0566582e-21
3.5730218e-22
-1.3947217e-21
3.1988766e-21
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0
-4.4259651e-23
-6.8096461e-23
1.3593208e-22
-1.7953135e-23
4.1807377e-22
-4.6454981e-22
1.5419861e-22
...
)
;
    }
    outerAtmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-4.6826118e-21
-4.6826118e-21
-2.0494627e-22
-9.1602773e-21
-3.1900566e-21
4.2727192e-21
-9.1602773e-21
-9.1602773e-21
...
)
;
    }
    axis
    {
        type            empty;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
