benchmarks/02_metal_bunsen_flame_cloud/0/Ccz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
80000
(
0.0001
0.0001
0.0001
0.0001
0.0001
0.0001
0.0001
0.0001
...
)
;

boundaryField
{
    nozzleInlet
    {
        type            calculated;
        value           uniform 0;
    }
    burnerWall
    {
        type            calculated;
        value           uniform 0;
    }
    coflowInlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.08
0.08
0.08
0.08
0.08
0.08
0.08
0.08
...
)
;
    }
    outerAtmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.0001
0.0003
0.0005
0.0007
0.0009
0.0011
0.0013
0.0015
...
)
;
    }
    axis
    {
        type            empty;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
