benchmarks/02_metal_bunsen_flame_cloud/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
defaultFieldValues
(
);
// File: system/setFieldsDict
regions
(
    boxToCell
    {
        // Sirf nozzle lip shear layer par spark
        box (0.009 -0.002 0.0005) (0.0105 0.002 0.0025);
        fieldValues
        (
            volScalarFieldValue T 2400
        );
    }
);
// ************************************************************************* //
